BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
/***************************************************************************//**
* \file `$INSTANCE_NAME`_SensingCSD_LL.c
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
*   This file defines the data structure global variables and provides
*   implementation for the low-level APIs of the CSD part of
*   the Sensing module. The file contains the APIs used for the CSD block
*   initialization, calibration, and scanning.
*
* \see CapSense v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/
#include "cy_device_headers.h"
#include "gpio/cy_gpio.h"
#include "cyfitter_sysint_cfg.h"

#include "`$INSTANCE_NAME`_ModClk.h"
#include "`$INSTANCE_NAME`_Structure.h"
#include "`$INSTANCE_NAME`_Configuration.h"
#include "`$INSTANCE_NAME`_SensingCSD_LL.h"
#include "`$INSTANCE_NAME`_Sensing.h"
`$CY_API_CALLBACK_HEADER_INCLUDE`

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN)

/***************************************
* API Constants
***************************************/
#define `$INSTANCE_NAME`_MOD_CSD_CLK_12MHZ                      (12000000uL)
#define `$INSTANCE_NAME`_MOD_CSD_CLK_24MHZ                      (24000000uL)
#define `$INSTANCE_NAME`_MOD_CSD_CLK_48MHZ                      (48000000uL)

#define `$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_TIME              (3u)
#define `$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_CYCLES_CALC       (`$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_TIME * `$INSTANCE_NAME`_CPU_CLOCK_FREQ_MHZ)

#if(`$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_CYCLES_CALC >= `$INSTANCE_NAME`_DELAY_EXTRACYCLES_NUM)
    #define `$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_CYCLES        (`$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_CYCLES_CALC -\
                                                                 `$INSTANCE_NAME`_DELAY_EXTRACYCLES_NUM)
#else
    #define `$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_CYCLES        (`$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_CYCLES_CALC)
#endif /* (`$INSTANCE_NAME`_COARSE_INIT_WATCHDOG_CYCLES_CALC >= `$INSTANCE_NAME`_DELAY_EXTRACYCLES_NUM) */

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_AUTO_ZERO_EN)
    #define `$INSTANCE_NAME`_CSD_AZ_ENABLE_CFG                  (`$INSTANCE_NAME`_CSD_HSCMP_AZ_EN_MSK)
#else
    #define `$INSTANCE_NAME`_CSD_AZ_ENABLE_CFG                  (0uL)
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_AUTO_ZERO_EN) */

#if (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
    #define `$INSTANCE_NAME`_HSCMP_SCAN_MASK                    (`$INSTANCE_NAME`_CSD_HSCMP_HSCMP_EN_MSK | `$INSTANCE_NAME`_CSD_AZ_ENABLE_CFG |\
                                                                 `$INSTANCE_NAME`_CSD_HSCMP_HSCMP_INVERT_MSK)
#else
    #define `$INSTANCE_NAME`_HSCMP_SCAN_MASK                    (`$INSTANCE_NAME`_CSD_HSCMP_HSCMP_EN_MSK | `$INSTANCE_NAME`_CSD_AZ_ENABLE_CFG)
#endif /* (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */

#define `$INSTANCE_NAME`_HSCMP_INIT_MASK                        (`$INSTANCE_NAME`_CSD_HSCMP_HSCMP_EN_MSK | `$INSTANCE_NAME`_CSD_AZ_ENABLE_CFG)

#define `$INSTANCE_NAME`_DEFAULT_SW_SHIELD_SEL                  (0x00000000uL)
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_DSI_SEL                 (0x00000000uL)
#define `$INSTANCE_NAME`_DEFAULT_CSD_INTR_SET                   (0x00000000uL)
#define `$INSTANCE_NAME`_DEFAULT_SW_HS_P_SEL                    (0x00000000uL)
#define `$INSTANCE_NAME`_DEFAULT_SW_HS_N_SEL                    (0x00000000uL)
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_TANK_SEL             (0x00000000uL)
#define `$INSTANCE_NAME`_DEFAULT_CSD_ADC_CTL                    (0x00000000uL)
#define `$INSTANCE_NAME`_DEFAULT_HSCMP_CFG                      (0x00000000uL)

#if (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG)
    #if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        #define `$INSTANCE_NAME`_DEFAULT_CSD_IO_SEL             (`$INSTANCE_NAME`_CSD_TX_N_OUT_EN_PHI1 | `$INSTANCE_NAME`_CSD_TX_N_AMUXA_EN_PHI2 |\
                                                                 `$INSTANCE_NAME`_CSD_TX_OUT_EN_PHI1_DELAY | `$INSTANCE_NAME`_CSD_TX_AMUXB_EN_PHI2_DELAY |\
                                                                 `$INSTANCE_NAME`_CSD_TX_OUT_MSK | `$INSTANCE_NAME`_CSD_TX_N_OUT_MSK)
    #else
        #define `$INSTANCE_NAME`_DEFAULT_CSD_IO_SEL             (`$INSTANCE_NAME`_CSD_TX_N_OUT_EN_PHI1 | `$INSTANCE_NAME`_CSD_TX_N_AMUXA_EN_PHI2 |\
                                                                                                         `$INSTANCE_NAME`_CSD_TX_N_OUT_MSK)
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */
#else
    #if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        #define `$INSTANCE_NAME`_DEFAULT_CSD_IO_SEL             (`$INSTANCE_NAME`_CSD_TX_N_OUT_EN_PHI1 | `$INSTANCE_NAME`_CSD_TX_N_AMUXA_EN_PHI2 |\
                                                                 `$INSTANCE_NAME`_CSD_TX_OUT_EN_PHI1_DELAY | `$INSTANCE_NAME`_CSD_TX_AMUXB_EN_PHI2_DELAY)
    #else
        #define `$INSTANCE_NAME`_DEFAULT_CSD_IO_SEL             (`$INSTANCE_NAME`_CSD_TX_N_OUT_EN_PHI1 | `$INSTANCE_NAME`_CSD_TX_N_AMUXA_EN_PHI2)
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */
#endif /* (`$INSTANCE_NAME`_IDAC_SINKING == `$INSTANCE_NAME`_CSD_IDAC_CONFIG) */


