BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Get IDACA Value */
    idacARegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR);

    /* Set IDACA Value mask */
    idacARegValue &= ~(`$INSTANCE_NAME`_CSD_IDACA_VAL_MSK);

    /* Set IDACA value */
    #if (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN)
        if (`$INSTANCE_NAME`_dsFlash.wdgtArray[(`$INSTANCE_NAME`_widgetIndex)].numCols <= `$INSTANCE_NAME`_sensorIndex)
        {
            idacARegValue |= (uint32)ptrWdgt->rowIdacMod[`$INSTANCE_NAME`_scanFreqIndex];
        }
        else
        {
            idacARegValue |= (uint32)ptrWdgt->idacMod[`$INSTANCE_NAME`_scanFreqIndex];
        }
    #else
        idacARegValue |= (uint32)ptrWdgt->idacMod[`$INSTANCE_NAME`_scanFreqIndex];
    #endif /* (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN) */

    /* Update IDACA register with new value */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR, idacARegValue);
    Cy_SysLib_ExitCriticalSection(interruptState);

    #if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
         (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN))
        interruptState = Cy_SysLib_EnterCriticalSection();
        /* Get IDACB Value */
        idacBRegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_IDACB_PTR);

        /* Set IDACB Value mask */
        idacBRegValue &= ~(`$INSTANCE_NAME`_CSD_IDACB_VAL_MSK);

        /* Set IDACB value */
        idacBRegValue |= (uint32)`$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_scanFreqIndex];

        /* Update IDACA register with new value */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACB_PTR, idacBRegValue);
        Cy_SysLib_ExitCriticalSection(interruptState);
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
               (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)) */
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDGetNumberOfConversions
****************************************************************************//**
*
* \brief
*  This function gets Number of conversions.
*
* \details
*  This function gets Number of conversions using following equation:
*   conversionsNum = (2^resolution - 1) / snsClkDivider.
*
* \param
*  snsClkDivider The divider value for the sense clock.
*  resolution The widget resolution.
*  snsClkSrc The current Sense Clock Source.
*
* \return Returns the Number of conversions.
*
*******************************************************************************/
uint32 `$INSTANCE_NAME`_SsCSDGetNumberOfConversions(uint32 snsClkDivider, uint32 resolution, uint32 snsClkSrc)
{
    uint32 conversionsNum;

    if(snsClkSrc == 0uL)
    {
        ;
    }

    /* Calculate scanning resolution value in register */
    conversionsNum = (uint32)((1uL << resolution) - 1uL);

    #if(`$INSTANCE_NAME`_SENSING_LOW_EMI == `$INSTANCE_NAME`_CSD_SENSING_METHOD)
        snsClkDivider = snsClkDivider -  (snsClkDivider / 5uL) - 1uL;
    #endif /* (`$INSTANCE_NAME`_SENSING_LOW_EMI == `$INSTANCE_NAME`_CSD_SENSING_METHOD) */

    if (0u < snsClkDivider)
    {
        conversionsNum /= snsClkDivider;
    }

    #if (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE)
        /* Use direct clock if pre-scalers have not been tuned */
        if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_prescalersTuningDone)
        {
    #endif /* (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) */
        #if ((`$INSTANCE_NAME`_CLK_SOURCE_PRS12 == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE) || \
             (`$INSTANCE_NAME`_CLK_SOURCE_PRS8 == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE))
             /* Divide by 4 for PRS8/PRS12 mode */
             conversionsNum >>= 2u;
        #elif (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
             snsClkDivider = snsClkDivider * (uint32)`$INSTANCE_NAME`_dsRam.modCsdClk;

             /* Check if PRS8/12 mode was set */
             if (((`$INSTANCE_NAME`_CLK_SOURCE_PRS8 == snsClkSrc) ||
                  (`$INSTANCE_NAME`_CLK_SOURCE_PRS12 == snsClkSrc)) &&
                 (`$INSTANCE_NAME`_HFCLK_SNSCLK_FACTOR >= snsClkDivider))
             {
                 /* Divide by 4 for PRS8/PRS12 mode */
                 conversionsNum >>= 2u;
             }
        #else
             /* SSC or Direct Clock mode  */
        #endif /* ((`$INSTANCE_NAME`_CLK_SOURCE_PRS12 == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE) || \
                   (`$INSTANCE_NAME`_CLK_SOURCE_PRS8 == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)) */
    #if (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE)
        }
    #endif /* (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) */

    return conversionsNum;
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDConfigClock
****************************************************************************//**
*
* \brief
*  This function configure sense clock for different modes.
*
* \details
*  Function sets the clock divider and configures the mode based on configuration.
*
*******************************************************************************/
void `$INSTANCE_NAME`_SsCSDConfigClock(void)
{
    uint32 snsClkDivider;
    uint32 newRegValue;

    #if ((`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_COMMON_SNS_CLK_EN) || \
         (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE))
        `$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *ptrWdgt = (`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *)
                 `$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].ptr2WdgtRam;
    #endif /* ((`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_COMMON_SNS_CLK_EN) || \
               (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)) */

    /* Get sense divider based on configuration */
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_COMMON_SNS_CLK_EN)
        snsClkDivider = (uint32)`$INSTANCE_NAME`_dsRam.snsCsdClk;
    #else
        #if (`$INSTANCE_NAME`_ENABLE == (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | \
                                         `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN))
            /*  Get SnsClck divider for rows or columns */
            if (`$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].numCols <= `$INSTANCE_NAME`_sensorIndex)
            {
                snsClkDivider = (uint32)(ptrWdgt->rowSnsClk);
            }
            else
            {
                snsClkDivider = (uint32)(ptrWdgt->snsClk);
            }
        #else
            snsClkDivider = (uint32)(ptrWdgt->snsClk);
        #endif /*  (`$INSTANCE_NAME`_ENABLE == (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | \
                                                `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN)) */
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_COMMON_SNS_CLK_EN) */

    #if (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
        /* Get sense clk source calculated in `$INSTANCE_NAME`_SsCSDInitialize() before */
        #if (`$INSTANCE_NAME`_ENABLE == (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | \
                                         `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN))
            /*  Get SnsClc Source for rows or columns */
            if (`$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].numCols <= `$INSTANCE_NAME`_sensorIndex)
            {
                newRegValue = (uint32)ptrWdgt->rowSnsClkSource;
            }
            else
            {
                newRegValue = (uint32)ptrWdgt->snsClkSource;
            }
        #else
            newRegValue = (uint32)ptrWdgt->snsClkSource;
        #endif /*  (`$INSTANCE_NAME`_ENABLE == (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | \
                                                `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN)) */
    #else
        newRegValue = `$INSTANCE_NAME`_DEFAULT_MODULATION_MODE;
    #endif /* (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE) */

    #if (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
        if ((`$INSTANCE_NAME`_CLK_SOURCE_PRS8 == newRegValue) ||
            (`$INSTANCE_NAME`_CLK_SOURCE_PRS12 == newRegValue))
        {
            newRegValue = (newRegValue << `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS) |
                `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SEL_LFSR_MSB_MSK;
        }
        else
        {
            newRegValue = (newRegValue << `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS);
        }
    #elif (`$INSTANCE_NAME`_CLK_SOURCE_PRS8 == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
        newRegValue = (newRegValue << `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS) |
            `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SEL_LFSR_MSB_MSK;
    #elif (`$INSTANCE_NAME`_CLK_SOURCE_PRS12 == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
        newRegValue = (newRegValue << `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS) |
            `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SEL_LFSR_MSB_MSK;
    #else
        newRegValue = (newRegValue << `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS);
    #endif /* (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE) */

    newRegValue |= `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_BITS_MSK;

    #if (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE)
        /* Use direct clock if pre-scalers have not been tuned */
        if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_prescalersTuningDone)
        {
            `$INSTANCE_NAME`_SsCSDSetModeSnsClockDivider(newRegValue, snsClkDivider);
        }
        else
        {
            `$INSTANCE_NAME`_SsSetSnsClockDivider(snsClkDivider);
        }
    #else
        `$INSTANCE_NAME`_SsCSDSetModeSnsClockDivider(newRegValue, snsClkDivider);
    #endif /* (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) */

    #if(`$INSTANCE_NAME`_SENSING_LOW_EMI == `$INSTANCE_NAME`_CSD_SENSING_METHOD)
        /* Calculate duration of the  first phase of the sense clock to have 80:20 duty cycle. */
        newRegValue = snsClkDivider / 5uL;
        /* Ensure at least 1 clk_csd cycle duration of the first phase of the sense clock. */
        newRegValue = (newRegValue > 0uL) ? newRegValue : 1uL;
        `$INSTANCE_NAME`_SsSetSnsFirstPhaseWidth(newRegValue);
    #endif /* (`$INSTANCE_NAME`_SENSING_LOW_EMI == `$INSTANCE_NAME`_CSD_SENSING_METHOD) */
}


