BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSDSetupWidgetExt
****************************************************************************//**
*
* \brief
*  Performs extended initialization for the CSD widget and also performs
*  initialization required for a specific sensor in the widget. This function
*  requires using the `$INSTANCE_NAME`_CSDScanExt() function to initiate a scan.
*
* \details
*  This function does the same as `$INSTANCE_NAME`_CSDSetupWidget() and also
*  does the following tasks:
*    1. Connects the first sensor of the widget.
*    2. Configures the IDAC value.
*    3. Initializes an interrupt callback function to initialize a scan of the
*  next sensors in a widget.
*
*  Once this function is called to initialize a widget and a sensor, the
*  `$INSTANCE_NAME`_CSDScanExt() function is called to scan the sensor.
*
*  This function is called when no scanning is in progress. I.e.
*  `$INSTANCE_NAME`_IsBusy() returns a non-busy status.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
* \param widgetId
*  Specifies the ID number of the widget to perform hardware and firmware
*  initialization required for scanning the specific sensor in the specific
*  widget.
*  A macro for the widget ID can be found in the `$INSTANCE_NAME` Configuration header
*  file defined as `$INSTANCE_NAME`_<WidgetName>_WDGT_ID.
*
* \param sensorId
*  Specifies the ID number of the sensor within the widget to perform hardware
*  and firmware initialization required for scanning a specific sensor in a
*  specific widget.
*  A macro for the sensor ID within a specified widget can be found in the
*  `$INSTANCE_NAME` Configuration header file defined as
*  `$INSTANCE_NAME`_<WidgetName>_SNS<SensorNumber>_ID
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSDSetupWidgetExt(uint32 widgetId, uint32 sensorId)
{
    `$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *ptrWdgt = (`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *)
                                                    `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2WdgtRam;

    /* Save widget and sensor Ids to have access to it after scanning  */
    `$INSTANCE_NAME`_sensorIndex = (uint8)sensorId;

    /*  Update global pointer to `$INSTANCE_NAME`_RAM_SNS_STRUCT to current sensor  */
    `$INSTANCE_NAME`_curRamSnsPtr = (`$INSTANCE_NAME`_RAM_SNS_STRUCT *)
                                              `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsRam
                                              + `$INSTANCE_NAME`_sensorIndex;

    `$INSTANCE_NAME`_CSDSetupWidget(widgetId);

     /* Setup Idac Value */
    `$INSTANCE_NAME`_SsCSDSetUpIdacs(ptrWdgt);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        /*  Initialise access pointers for current pointer to widget configuration in Flash */
        `$INSTANCE_NAME`_curFlashWdgtPtr = &`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId];
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)  */

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        `$INSTANCE_NAME`_SsCSDConnectSensorExt(widgetId, sensorId);
    #else
        /* Enable sensor */
        `$INSTANCE_NAME`_curSnsIOPtr += `$INSTANCE_NAME`_sensorIndex;
        `$INSTANCE_NAME`_CSDConnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)  */

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        /* Save sns pointer */
        `$INSTANCE_NAME`_curFlashSnsPtr = (`$INSTANCE_NAME`_FLASH_SNS_STRUCT const *)
                                           `$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].ptr2SnsFlash +
                                           `$INSTANCE_NAME`_sensorIndex;
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) */

    `$INSTANCE_NAME`_eleCsdDisconnectFlag = `$INSTANCE_NAME`_DISCONNECT_IO_FLAG;

    /*  Setup ISR handler to single-sensor scan function */
    `$INSTANCE_NAME`_SsIsrInitialize(&`$INSTANCE_NAME`_CSDPostSingleScan);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDStartSample
****************************************************************************//**
*
* \brief
*   Starts the CSD conversion.
*
* \details
*   This function assumes that the CSD block is already set up using
*   the `$INSTANCE_NAME`_CSDSetupWidget API and the sensor port-pin is connected to the CSD
*   block using `$INSTANCE_NAME`_CSDConnectSns.
*   For CSDv1 the function performs the following tasks:
*   1. Disconnects the Vref buffer from AMUX;
*   2. Precharges Cmod;
*   3. Makes the PreSettling delay to have a stable Vref voltage;
*   4. Sets the resolution to the Counter register to start scanning.
*
*******************************************************************************/
void `$INSTANCE_NAME`_SsCSDStartSample(void)
{
    /* CSDv2 HW IP block section */

    #ifdef `$INSTANCE_NAME`_START_SAMPLE_CALLBACK
        `$INSTANCE_NAME`_StartSampleCallback(`$INSTANCE_NAME`_widgetIndex, `$INSTANCE_NAME`_sensorIndex);
    #endif /* `$INSTANCE_NAME`_START_SAMPLE_CALLBACK */

    /* Disable interrupt */
    #if defined(`$INSTANCE_NAME`_ISR__INTC_ASSIGNED)
        NVIC_DisableIRQ(`$INSTANCE_NAME`_ISR_cfg.intrSrc);
    #endif

    /* Enable power to sub-blocks */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_HSCMP_PTR, `$INSTANCE_NAME`_HSCMP_INIT_MASK);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN)
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_CONFIG_PTR, `$INSTANCE_NAME`_configCsd |
                                                  `$INSTANCE_NAME`_CSD_CONFIG_SENSE_EN_MSK |
                                                  `$INSTANCE_NAME`_CSD_CONFIG_ENABLE_MSK);
        #if(`$INSTANCE_NAME`_CSD_ANALOG_STARTUP_DELAY_US > 0uL)
            Cy_SysLib_DelayUs(`$INSTANCE_NAME`_CSD_ANALOG_STARTUP_DELAY_US);
        #endif /* (`$INSTANCE_NAME`_CSD_ANALOG_STARTUP_DELAY_US > 0uL) */
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN) */

    /* Precharging Cmod and Csh */
    `$INSTANCE_NAME`_SsCSDCmodPrecharge();

    /* Trigger Scan */
    `$INSTANCE_NAME`_SsCSDTriggerScan();
}


