BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSDScanExt
****************************************************************************//**
*
* \brief
*  Starts the CSD conversion on the preconfigured sensor. This function requires
*  using the `$INSTANCE_NAME`_CSDSetupWidgetExt() function to set up the a
*  widget.
*
* \details
*  This function performs single scanning of one sensor in the widget configured
*  by the `$INSTANCE_NAME`_CSDSetupWidgetExt() function. It does the following
*  tasks:
*    1. Sets the busy flag in the `$INSTANCE_NAME`_dsRam structure.
*    2. Performs the clock-phase alignment of the sense and modulator clocks.
*    3. Performs the Cmod pre-charging.
*    4. Starts single scanning.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*  This function is called when no scanning is in progress. I.e.
*  `$INSTANCE_NAME`_IsBusy() returns a non-busy status.
*
*  The sensor must be preconfigured by using the
*  `$INSTANCE_NAME`_CSDSetupWidgetExt() API prior to calling this function.
*  The sensor remains ready for a next scan if a previous scan was triggered
*  by using the `$INSTANCE_NAME`_CSDScanExt() function. In this case, calling
*  `$INSTANCE_NAME`_CSDSetupWidgetExt() is not required every time before the
*  `$INSTANCE_NAME`_CSDScanExt() function. If a previous scan was triggered in
*  any other way - `$INSTANCE_NAME`_Scan(), `$INSTANCE_NAME`_ScanAllWidgets() or
*  `$INSTANCE_NAME`_RunTuner() - (see the `$INSTANCE_NAME`_RunTuner() function
*  description for more details), the sensor must be preconfigured again by
*  using the `$INSTANCE_NAME`_CSDSetupWidgetExt() API prior to calling the
*  `$INSTANCE_NAME`_CSDScanExt() function.
*
*  If disconnection of the sensors is required after calling
*  `$INSTANCE_NAME`_CSDScanExt(), the `$INSTANCE_NAME`_CSDDisconnectSns()
*  function can be used.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSDScanExt(void)
{
    /* Set Start of sensor scan flag */
    `$INSTANCE_NAME`_dsRam.status |= (`$INSTANCE_NAME`_SW_STS_BUSY | `$INSTANCE_NAME`_WDGT_SW_STS_BUSY);

    #if (`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN)
        #if(`$INSTANCE_NAME`_CSD_ANALOG_STARTUP_DELAY_US > 0uL)
            Cy_SysLib_DelayUs(`$INSTANCE_NAME`_CSD_ANALOG_STARTUP_DELAY_US);
        #endif /* (`$INSTANCE_NAME`_CSD_ANALOG_STARTUP_DELAY_US > 0uL) */
    #endif /* (`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN) */

    `$INSTANCE_NAME`_SsCSDStartSample();
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSDScan
****************************************************************************//**
*
* \brief
*  This function initiates a scan for the sensors of the widget initialized by the
*  `$INSTANCE_NAME`_CSDSetupWidget() function.
*
* \details
*  This function performs scanning of all the sensors in the widget configured by
*  the `$INSTANCE_NAME`_CSDSetupWidget() function. It does the following tasks:
*    1. Connects the first sensor of the widget.
*    2. Configures the IDAC value.
*    3. Initializes the interrupt callback function to initialize a scan of
*       the next sensors in a widget.
*    4. Starts scanning for the first sensor in the widget.
*
*  This function is called by the `$INSTANCE_NAME`_Scan() API if the given
*  widget uses the CSD sensing method.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
*  This function is called when no scanning is in progress. I.e.
*  `$INSTANCE_NAME`_IsBusy() returns a non-busy status. The widget must be
*  preconfigured by the `$INSTANCE_NAME`_CSDSetupWidget() function if any other
*  widget was previously scanned or any other type of the scan functions was used.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSDScan(void)
{
    `$INSTANCE_NAME`_RAM_WD_BASE_STRUCT const *ptrWdgt = (`$INSTANCE_NAME`_RAM_WD_BASE_STRUCT *)
                                                    `$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].ptr2WdgtRam;

     /*
      * Update `$INSTANCE_NAME`_sensorIndex with the first sensor in
      * widget to use it in ISR handler to configure the next sensor
      */
    `$INSTANCE_NAME`_sensorIndex = 0u;

    /*  Update global pointer to `$INSTANCE_NAME`_RAM_SNS_STRUCT to current sensor  */
    `$INSTANCE_NAME`_curRamSnsPtr = (`$INSTANCE_NAME`_RAM_SNS_STRUCT *)
                                              `$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].ptr2SnsRam
                                              + `$INSTANCE_NAME`_sensorIndex;

    /* Setup Idac Value */
   `$INSTANCE_NAME`_SsCSDSetUpIdacs(ptrWdgt);

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        /* Check ganged sns flag  */
        if (`$INSTANCE_NAME`_GANGED_SNS_MASK == (`$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].staticConfig &
            `$INSTANCE_NAME`_GANGED_SNS_MASK))
        {
            /*  Setup ISR handler to multiple-sensor scan function with ganged sensors */
            `$INSTANCE_NAME`_SsIsrInitialize(&`$INSTANCE_NAME`_CSDPostMultiScanGanged);
        }
        else
        {
            /*  Set up ISR handler to multiple-sensor scan function without ganged sensors */
            `$INSTANCE_NAME`_SsIsrInitialize(&`$INSTANCE_NAME`_CSDPostMultiScan);
        }

        `$INSTANCE_NAME`_SsCSDConnectSensorExt((uint32)`$INSTANCE_NAME`_widgetIndex, (uint32)`$INSTANCE_NAME`_sensorIndex);
    #else
        /* Initialise ptr to sensor IO structure to appropriate address */
        `$INSTANCE_NAME`_curSnsIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)
                                        `$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].ptr2SnsFlash
                                        + `$INSTANCE_NAME`_sensorIndex;

        /* Enable sensor */
        `$INSTANCE_NAME`_CSDConnectSns(`$INSTANCE_NAME`_curSnsIOPtr);

        /*  Set-up ISR handler to multiple-sensor scan function without ganged sensors */
        `$INSTANCE_NAME`_SsIsrInitialize(&`$INSTANCE_NAME`_CSDPostMultiScan);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)  */

    /* Start scanning */
    `$INSTANCE_NAME`_CSDScanExt();
}


