BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDConnectSensorExt
****************************************************************************//**
*
* \brief
*  Connects a ganged sensor port-pin to the CapSense block via the AMUX bus.
*
* \details
*   The function gets the IO configuration registers addresses, their shifts and
*   masks from the FLASH_IO_STRUCT object. Basing on this data, it updates the HSIOM and
*   PC registers.
*
* \param widgetId
*  Specifies ID of the widget.
*
* \param sensorId
*  Specifies ID of the sensor in the widget.
*
*******************************************************************************/
void `$INSTANCE_NAME`_SsCSDConnectSensorExt(uint32 widgetId, uint32 sensorId)
{
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        uint32 tempVal;
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) */

    /*  Initialise ptr to sensor IO structure to appropriate address */
    `$INSTANCE_NAME`_curSnsIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)
                                                      `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsFlash
                                                      + sensorId;

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        /* Check ganged sns flag  */
        if (`$INSTANCE_NAME`_GANGED_SNS_MASK ==
           (`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].staticConfig &
            `$INSTANCE_NAME`_GANGED_SNS_MASK))
        {
            /* Get sns pointer */
            `$INSTANCE_NAME`_curFlashSnsPtr = (`$INSTANCE_NAME`_FLASH_SNS_STRUCT const *)
                                               `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsFlash +
                                               sensorId;

            /* Get number of ganged pins */
            tempVal = `$INSTANCE_NAME`_curFlashSnsPtr->numPins;

            /* Get IO pointer  */
            `$INSTANCE_NAME`_curSnsIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curFlashSnsPtr->firstPinId];

            /* Connect all ganged sensors  */
            do
            {
                `$INSTANCE_NAME`_CSDConnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
                `$INSTANCE_NAME`_curSnsIOPtr++;
                tempVal--;
            } while (0u != tempVal);
        }
        else
        {
            /* Connect sensor */
            `$INSTANCE_NAME`_CSDConnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
        }
    #else
        /* Connect sensor */
        `$INSTANCE_NAME`_CSDConnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) */
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDDisconnectSnsExt
****************************************************************************//**
*
* \brief
*  Disconnects a ganged sensor port-pin from the CapSense block and AMUX bus.
*  Sets the default state of the un-scanned sensor.
*
* \details
*   The function gets the IO configuration registers addresses, their shifts and
*   masks from the FLASH_IO_STRUCT object. Basing on this data and Inactive sensor
*   connection parameter, it updates the HSIOM, PC and DR registers.
*   The HSIOM register is updated only when the Inactive sensor connection parameter
*   is set to Shield.
*
* \param widgetId
*  Specifies ID of the widget.
*
* \param sensorId
*  Specifies ID of the sensor in the widget.
*
*******************************************************************************/
void `$INSTANCE_NAME`_SsCSDDisconnectSnsExt(uint32 widgetId, uint32 sensorId)
{
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        uint32 tempVal;
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) */

    /*  Initialise ptr to sensor IO structure to appropriate address        */
    `$INSTANCE_NAME`_curSnsIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)
                                                      `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsFlash
                                                      + sensorId;

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
        /* Check ganged sns flag  */
        if ((`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].staticConfig &
            `$INSTANCE_NAME`_GANGED_SNS_MASK) == `$INSTANCE_NAME`_GANGED_SNS_MASK)
        {
            /* Get sns pointer */
            `$INSTANCE_NAME`_curFlashSnsPtr = (`$INSTANCE_NAME`_FLASH_SNS_STRUCT const *)
                                               `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsFlash +
                                               sensorId;

            /* Get number of ganged pins */
            tempVal = `$INSTANCE_NAME`_curFlashSnsPtr->numPins;

            /* Get IO pointer  */
            `$INSTANCE_NAME`_curSnsIOPtr = &`$INSTANCE_NAME`_ioList[`$INSTANCE_NAME`_curFlashSnsPtr->firstPinId];

            /* Disconnect all ganged sensors */
            do
            {
                `$INSTANCE_NAME`_CSDDisconnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
                `$INSTANCE_NAME`_curSnsIOPtr++;
                tempVal--;
            } while (0u != tempVal);
        }
        else
        {
            /* Disconnect ganged sensor */
            `$INSTANCE_NAME`_CSDDisconnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
        }
    #else
        /* Disconnect ganged sensor */
        `$INSTANCE_NAME`_CSDDisconnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) */
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSDConnectSns
****************************************************************************//**
*
* \brief
*  Connects a port pin used by the sensor to the AMUX bus of the CapSense block.
*
* \details
*  Connects a port pin used by the sensor to the AMUX bus of the CapSense block
*  while a sensor is being scanned. The function ignores the fact if
*  the sensor is a ganged sensor and connects only a specified pin.
*
*  Scanning should be completed before calling this API.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases. Functions that perform a setup and scan of a sensor/widget,
*  automatically set the required pin states and perform the sensor connection.
*  They do not take into account changes in the design made by the
*  `$INSTANCE_NAME`_CSDConnectSns() function.
*
* \param  snsAddrPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
*  which to be connected to the CapSense block.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSDConnectSns(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *snsAddrPtr)
{
    uint32  interruptState;

