BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_CSD_SENSE);
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_CSDDisconnectSns
****************************************************************************//**
*
* \brief
*  Disconnects a sensor port pin from the CapSense block and the AMUX bus. Sets
*  the default state of the un-scanned sensor.
*
* \details
*  This function works identically to `$INSTANCE_NAME`_CSDConnectSns() except
*  it disconnects the specified port-pin used by the sensor.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases. Functions that perform a setup and scan of sensor/widget
*  automatically set the required pin states and perform the sensor connection.
*  They ignore changes in the design made by the
*  `$INSTANCE_NAME`_CSDDisconnectSns() function.
*
* \param  snsAddrPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
*  which should be disconnected from the CapSense block.
*
*******************************************************************************/
void `$INSTANCE_NAME`_CSDDisconnectSns(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *snsAddrPtr)
{
    uint32  interruptState;

    #if ((`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) ||  \
        (`$INSTANCE_NAME`_SNS_CONNECTION_SHIELD != `$INSTANCE_NAME`_CSD_INACTIVE_SNS_CONNECTION))
        interruptState = Cy_SysLib_EnterCriticalSection();
        Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber, (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_GPIO);
        Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber, `$INSTANCE_NAME`_CSD_INACTIVE_SNS_GPIO_DM);
        Cy_GPIO_Clr((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber);
        Cy_SysLib_ExitCriticalSection(interruptState);
    #else
        interruptState = Cy_SysLib_EnterCriticalSection();
        Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber, `$INSTANCE_NAME`_CSD_INACTIVE_SNS_GPIO_DM);
        Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber, `$INSTANCE_NAME`_HSIOM_SEL_CSD_SHIELD);
        Cy_GPIO_Clr((GPIO_PRT_Type*)snsAddrPtr->pcPtr, (uint32)snsAddrPtr->pinNumber);
        Cy_SysLib_ExitCriticalSection(interruptState);
    #endif /* ((`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && \
                (`$INSTANCE_NAME`_SNS_CONNECTION_SHIELD != `$INSTANCE_NAME`_CSD_INACTIVE_SNS_CONNECTION)) */
}


#if ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN))
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN)
        /*******************************************************************************
        * Function Name: `$INSTANCE_NAME`_SsCSDSetSingleIdacMode
        ****************************************************************************//**
        *
        * \brief
        *  This function set single IDAC mode.
        *
        * \details
        *   For CSDv1: The function enables Modulator IDAC only in variable mode.
        *   For CSDv2: The function enables IDACA LEG1 in CSD mode, IDACA LEG2 in GP mode.
        *
        *******************************************************************************/
        static void `$INSTANCE_NAME`_SsCSDSetSingleIdacMode(void)
        {
            uint32 newRegValue;

            /* Enable IDACA LEG1 in CSD mode, IDACA LEG2 in GP mode */
            newRegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR) &
                          `$INSTANCE_NAME`_CSD_IDACA_VAL_MSK;
            newRegValue |= `$INSTANCE_NAME`_IDAC_MOD_CALIBRATION_CFG;
            CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACA_PTR, newRegValue);
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
                (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)
                newRegValue = CY_GET_REG32(`$INSTANCE_NAME`_CSD_IDACB_PTR) & `$INSTANCE_NAME`_CSD_IDACB_VAL_MSK;
                newRegValue |= `$INSTANCE_NAME`_IDAC_COMP_CALIBRATION_CFG;
                CY_SET_REG32(`$INSTANCE_NAME`_CSD_IDACB_PTR, newRegValue);
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
                      (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN */
        }
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) */
#endif /* ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN)) */

#if ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN))
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN)
        /*******************************************************************************
        * Function Name: `$INSTANCE_NAME`_SsCSDRestoreIdacMode
        ****************************************************************************//**
        *
        * \brief
        *  This function restores IDAC configuration.
        *
        * \details
        *   The function restores Compensation IDAC if it is enabled.
        *
        *******************************************************************************/
        static void `$INSTANCE_NAME`_SsCSDRestoreIdacMode(void)
        {
            /* Restore IDAC configuration */
            uint32 newRegValue;

