BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
        /*
         * Perform the iteration steps to get target = rawLevel.
         * The number of iteration steps is defined by calMask and depend on IDAC resolution.
         */
        do
        {
            /* Scan sensor */
            `$INSTANCE_NAME`_CSDScanExt();

            /* Initialize Watchdog Counter with time interval which is enough to charge 100 nF capacitor */
            watchdogCounter = `$INSTANCE_NAME`_CALIBR_WATCHDOG_CYCLES_NUM;
            while (((*(volatile uint8 *)&`$INSTANCE_NAME`_dsRam.status & `$INSTANCE_NAME`_SW_STS_BUSY) != 0u) &&
                   (0u != watchdogCounter))
            {
                /* Wait until scan complete and decrement Watchdog Counter to prevent unending loop */
                watchdogCounter--;
            }

            /* Read rawData */
            rawData0 = `$INSTANCE_NAME`_curRamSnsPtr->raw[0u];
            #if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                rawData1 = `$INSTANCE_NAME`_curRamSnsPtr->raw[`$INSTANCE_NAME`_FREQ_CHANNEL_1];
                rawData2 = `$INSTANCE_NAME`_curRamSnsPtr->raw[`$INSTANCE_NAME`_FREQ_CHANNEL_2];
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

            /* Decrease IDAC until rawData reaches rawLevel */
            if (rawData0 < rawLevel)
            {
                /* Reset bit for null channel (decrease IDAC -> will increase rawData) */
                ptrIdac[0u] &= (uint8)(~calMask);
            }
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                if (rawData1 < rawLevel)
                {
                    /* Reset bit for null channel  */
                    ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1] &= (uint8)(~calMask);
                }
                if (rawData2 < rawLevel)
                {
                    /* Reset bit for null channel  */
                    ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2] &= (uint8)(~calMask);
                }
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

            /* Shift calMask to set or reset next bit */
            calMask >>= 1u;

            /* Set bit for null channel */
            ptrIdac[0u] |= calMask;
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1] |= calMask;
                ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2] |= calMask;
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

            /* Update IDAC */
            `$INSTANCE_NAME`_SsCSDSetUpIdacs(ptrWdgt);
        }
        while (calMask > 0u);

        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
            `$INSTANCE_NAME`_SsCSDDisconnectSnsExt((uint32)`$INSTANCE_NAME`_widgetIndex, (uint32)`$INSTANCE_NAME`_sensorIndex);
        #else
            /*  Initialise pointer to sensor IO structure    */
            `$INSTANCE_NAME`_curSnsIOPtr = (`$INSTANCE_NAME`_FLASH_IO_STRUCT const *)
                                            `$INSTANCE_NAME`_dsFlash.wdgtArray[`$INSTANCE_NAME`_widgetIndex].ptr2SnsFlash
                                            + `$INSTANCE_NAME`_sensorIndex;

            /* Disable sensor */
            `$INSTANCE_NAME`_CSDDisconnectSns(`$INSTANCE_NAME`_curSnsIOPtr);
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)  */

        /* Set flag about disconnecting the electrode */
        `$INSTANCE_NAME`_eleCsdDisconnectFlag = 0u;

        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN)
            /* Restore IDAC configuration to default state */
            `$INSTANCE_NAME`_SsCSDRestoreIdacMode();
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

        /* Check if IDAC is in correct range */
        calibrateStatus = `$INSTANCE_NAME`_SsCSDCalibrateCheck(ptrWdgt, rawLevel, rawData0);
        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
            calibrateStatus |= `$INSTANCE_NAME`_SsCSDCalibrateCheck(ptrWdgt, rawLevel, rawData1);
            calibrateStatus |= `$INSTANCE_NAME`_SsCSDCalibrateCheck(ptrWdgt, rawLevel, rawData2);
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

        /*
         * Update maximum IDAC value in widget. iDAC8Max variable will contain
         * maximum IDAC value after all the sensors in a widget have been scanned.
         */
        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
            if (iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_0] < ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_0])
            {
                iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_0] = ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_0];
            }
            if (iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_1] < ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1])
            {
                iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_1] = ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1];
            }
            if (iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_2] < ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2])
            {
                iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_2] = ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2];
            }
        #else
            if (*iDAC8Max < ptrIdac[0u])
            {
                *iDAC8Max = ptrIdac[0u];
            }
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN)
            /*
             * Store temporary ModIDAC8 value (in single-IDAC mode) in idacComp variable.
             * We need this value to calculate idacMod value the in the dual-IDAC mode.
             */
            `$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u] = ptrIdac[0u];
            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_1] = ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1];
                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_2] = ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2];
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) */

        return (calibrateStatus);
    }

