BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
                    /* Do same for second frequency channel  */
                    iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_2] = 1u;
                #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

                /* Go through all columns of touchpad to calibrate them */
                for (`$INSTANCE_NAME`_sensorIndex = `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].numCols;
                     `$INSTANCE_NAME`_sensorIndex < (uint8)`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].totalNumSns;
                     `$INSTANCE_NAME`_sensorIndex++)
                {
                    /* Calibrate current sensor in widget */
                    calibrateStatus |= `$INSTANCE_NAME`_SsCSDCalibrateOneSensor(rawLevel, ptrIdac, iDAC8Max);
                }

                /* Normalize idacMod and idacComp values */
                #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN)
                    /* Calculate Modulator value: idacMod = (iDAC8Max + 1)/2  */
                    ptrIdac[0u] = (iDAC8Max[0u] + 1u) >> 1u;
                    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                        /* Do same for first frequency channel  */
                        ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1] =  (iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_1] + 1u) >> 1u;

                        /* Do same for second frequency channel  */
                        ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2] = (iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_2] + 1u) >> 1u;
                    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

                    /* Go through all columns of touchpad to normalize them */
                    for (`$INSTANCE_NAME`_sensorIndex = `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].numCols;
                         `$INSTANCE_NAME`_sensorIndex < (uint8)`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].totalNumSns;
                         `$INSTANCE_NAME`_sensorIndex++)
                    {
                        `$INSTANCE_NAME`_curRamSnsPtr = (`$INSTANCE_NAME`_RAM_SNS_STRUCT *)
                                 `$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId].ptr2SnsRam + `$INSTANCE_NAME`_sensorIndex;

                        /* Calculate Compensation IDAC value: idacComp(i) = (iDAC8(i) - idacMod) * 85% */
                        if (`$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u] >= ptrIdac[0u])
                        {
                            `$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u] -= ptrIdac[0u];
                            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)
                                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u] =
                                    (uint8)((((target * `$INSTANCE_NAME`_curRamSnsPtr->idacComp[0u]) +
                                        `$INSTANCE_NAME`_PERCENTAGE_100) - 1u) / `$INSTANCE_NAME`_PERCENTAGE_100);
                            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN) */
                        }
                        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                            /* Do same for first frequency channel  */
                            if (`$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_1] >= ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1])
                            {
                                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_1] -= ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1];
                                #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)
                                    `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_1] =
                                        (uint8)((((target * `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_1]) +
                                        `$INSTANCE_NAME`_PERCENTAGE_100) - 1u) / `$INSTANCE_NAME`_PERCENTAGE_100);
                                #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN) */
                            }
                            /* Do same for second frequency channel  */
                            if (`$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_2] >= ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2])
                            {
                                `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_2] -= ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2];
                                #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)
                                    `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_2] =
                                        (uint8)((((target * `$INSTANCE_NAME`_curRamSnsPtr->idacComp[`$INSTANCE_NAME`_FREQ_CHANNEL_2]) +
                                        `$INSTANCE_NAME`_PERCENTAGE_100) - 1u) / `$INSTANCE_NAME`_PERCENTAGE_100);
                                #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN) */
                            }
                        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */
                    }
                #else
                    /* Normalize widget for single-IDAC mode*/
                    ptrIdac[0u] = iDAC8Max[0u];
                    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
                        ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_1] = iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_1];
                        ptrIdac[`$INSTANCE_NAME`_FREQ_CHANNEL_2] = iDAC8Max[`$INSTANCE_NAME`_FREQ_CHANNEL_2];
                    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */
                #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) */
            }
        #endif /* (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN) */

