BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
        `$INSTANCE_NAME`_sensorIndex = 0u;

        return calibrateStatus;
    }
#endif /* ((`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE)) || \
            (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN))  */


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDCmodPrecharge
****************************************************************************//**
*
* \brief
*  This function initializes the Cmod charging to Vref.
*
* \details
*  For CSDv1:
*  The function initializes the Cmod charging to Vref.
*  Then it waits the even when Cmod is completely charged
*  to Vref to have stable Rawcounts. Software Watchdog Counter is implemented to
*  prevent the project hanging.
*
*  For CSDv2:
*  Coarse initialization for CMOD and Cch.
*  The coarse initialization is performed by HSCOMP.
*  The HSCOMP monitors the Cmod voltage via Cmod sense path
*  and charges the Cmod using HCAV switch via CSDBUS-A, AMUXBUS-A
*  and static connection of Cmod to AMUXBUS-A.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_SsCSDCmodPrecharge(void)
{
    uint32 watchdogCounter;

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_CSDCMP_PTR, `$INSTANCE_NAME`_CSD_CSDCMP_INIT);

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_PTR,  `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_INIT);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_INIT);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_PTR,  `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_INIT);
    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        /*
         * Connect CMOD to (sense path) to HSCOMP: HMPM or HMPS or HMPT switches depend on Cmod connects to certain pad
         * Connect AMUXBUS-B to HSCMP positive input
         */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_COARSE);

        #if(0u != `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN)
            /* Connect CTANK to AMUXBUS-A */
            Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)`$INSTANCE_NAME`_CSD_CTANK_PORT_PTR, `$INSTANCE_NAME`_CSD_CTANK_PIN,
                                                                       (en_hsiom_sel_t)`$INSTANCE_NAME`_HSIOM_SEL_AMUXA);
        #endif /* (0u != `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN) */
    #else
        /* Connect CMOD to (sense path) to HSCOMP: HMPM or HMPS or HMPT switches depend on Cmod connects to certain pad */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_COARSE);
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_RES_PTR, `$INSTANCE_NAME`_CSD_SW_RES_INIT);

    /* Clear all interrupt pending requests */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR, `$INSTANCE_NAME`_CSD_INTR_ALL_MSK);
    (void)CY_GET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR);

    /* Unmask INIT interrupt (enable interrupt) */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_MASK_PTR, `$INSTANCE_NAME`_CSD_INTR_MASK_CLEAR_MSK);

    /* Start SEQUENCER for coarse initialization for Cmod */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR, `$INSTANCE_NAME`_CSD_SEQ_START_SEQ_MODE_MSK |
                                                 `$INSTANCE_NAME`_CSD_SEQ_START_START_MSK);

    /* Init Watchdog Counter to prevent a hang */
    watchdogCounter = `$INSTANCE_NAME`_CSD_PRECHARGE_WATCHDOG_CYCLES_NUM;

    /* Wait for INTR.INIT goes high */
    while((0u == (CY_GET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR) & `$INSTANCE_NAME`_CSD_INTR_INIT_MSK)) && (0u != watchdogCounter))
    {
        watchdogCounter--;
    }

    if (0u == watchdogCounter)
    {
        /* Set sequencer to idle state if coarse initialization fails */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR, `$INSTANCE_NAME`_CSD_SEQ_START_ABORT_MSK);
    }
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SsCSDTriggerScan
****************************************************************************//**
*
* \brief
*  This function triggers the scanning.
*
* \details
*  For CSDv1:
*  Writes resolution to start the scanning.
*
*  For CSDv2:
*  Trigger the fine initialization (scan some dummy cycles) and start sampling.
*  Fine initialization for CMOD and Start scan.
*  For the fine initialization and sampling, Cmod is static connected to AMUXBUS-A
*  and in every conversion (one cycle of SnsClk), the sensor capacitance is charged
*  from Cmod and discharged to ground using the switches in GPIO cell.
*  The CSDCOMP monitors voltage on Cmod using the sense path and charges Cmod back
*  to Vref using IDACs by connecting IDAC to CSDBUS-A and then the AMUXBUS-A.
*
*******************************************************************************/
__STATIC_INLINE void `$INSTANCE_NAME`_SsCSDTriggerScan(void)
{
    uint32 watchdogCounter;

    /* Clear previous interrupts */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR, `$INSTANCE_NAME`_CSD_INTR_ALL_MSK);
    (void)CY_GET_REG32(`$INSTANCE_NAME`_CSD_INTR_PTR);

    /* Enable interrupt */
    #if defined(`$INSTANCE_NAME`_ISR__INTC_ASSIGNED)
        NVIC_EnableIRQ(`$INSTANCE_NAME`_ISR_cfg.intrSrc);
    #endif

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SCAN);

    /* Set scanning configuration for switches */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_PTR, `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SCAN);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_PTR,`$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SCAN);

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_PTR,  `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SCAN);

    #if((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN))
        /* Connect CTANK to AMUXBUS-B */
        `$INSTANCE_NAME`_SsCSDEnableShieldTank();
    #endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) && (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_SHIELD_TANK_EN)) */

    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SW_RES_PTR, `$INSTANCE_NAME`_CSD_SW_RES_SCAN);
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_CSDCMP_PTR, `$INSTANCE_NAME`_CSD_CSDCMP_SCAN);

