BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_SensingCSD_LL.c
    #if (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN)
        /* Disable HSCOMP during the sampling phase when shield is disabled */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_HSCMP_PTR, 0u);
    #else
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_HSCMP_PTR, `$INSTANCE_NAME`_HSCMP_SCAN_MASK);
    #endif /* (`$INSTANCE_NAME`_DISABLE == `$INSTANCE_NAME`_CSD_SHIELD_EN) */

    #if (`$INSTANCE_NAME`_CLK_SOURCE_DIRECT != `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
        /*  Force the LFSR to it's initial state (all ones) */
        CY_SET_REG32(`$INSTANCE_NAME`_CSD_SENSE_PERIOD_PTR, CY_GET_REG32(`$INSTANCE_NAME`_CSD_SENSE_PERIOD_PTR) |
                                                       `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_CLEAR_MSK);
    #endif /* (`$INSTANCE_NAME`_CLK_SOURCE_DIRECT != `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE) */

    /* Enable SAMPLE interrupt */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_INTR_MASK_PTR, `$INSTANCE_NAME`_CSD_INTR_MASK_SAMPLE_MSK);

    /* Init Watchdog Counter to prevent a hang */
    watchdogCounter = `$INSTANCE_NAME`_CSD_PRECHARGE_WATCHDOG_CYCLES_NUM;

    /* Wait for IDLE state of the CSDv2 HW sequencer */
    while((0u != (`$INSTANCE_NAME`_CSD_STAT_SEQ_REG & `$INSTANCE_NAME`_CSD_STAT_SEQ_SEQ_STATE_MSK)) && (0u != watchdogCounter))
    {
        watchdogCounter--;
    }

    /* Start SEQUENCER for fine initialization scan for Cmod and then for normal scan */
    CY_SET_REG32(`$INSTANCE_NAME`_CSD_SEQ_START_PTR, `$INSTANCE_NAME`_CSD_SEQ_START_AZ0_SKIP_MSK |
                                                 `$INSTANCE_NAME`_CSD_SEQ_START_AZ1_SKIP_MSK |
                                                 `$INSTANCE_NAME`_CSD_SEQ_START_START_MSK);
}

#endif  /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN) */


/* [] END OF FILE */
